# Lab 5 : Prise en main de Pandas

L'objectif de cette fiche d'exercices est de découvrir un outil que nous utiliserons dans le lab 5:
+ [Pandas](https://pandas.pydata.org/) : une bibliothèque python spécialisée dans l'analyse de données qui est très utilisée en science des données, notamment pour la manipulation de données. Cette librairie permet notamment de manipuler les données à l'aide de **Data Frame** (tableau de données), ce qui peut être très utile.

# PANDAS

Cette partie s'inspire des très bon tutoriels de [Philippe Besse](https://www.math.univ-toulouse.fr/~besse/Wikistat/pdf/st-tutor2-python-pandas.pdf) et de [Xavier Dupré](http://www.xavierdupre.fr/app/ensae_teaching_cs/helpsphinx/ml2a/td_2a_manip.html#matrices-et-dataframes-numpy-pandas-sql). De nombreux autres tutoriels sont disponibles en ligne : http://pandas.pydata.org/pandas-docs/stable/tutorials.html

La bibliothèque Pandas possède de nombreuses riches foncionnalités qui sont à l'origine de son succès et de l'utilisation de Python pour extraire, préparer, et éventuellement analyser des données. En particulier:

+ **Objets** : les classes **Series** et **DataFrame** ou table de données.
+ **Lire, écrire** :  création et exportation de tables de données à partir de fichiers textes (séparateurs, .csv, format fixe, compressés), binaires (HDF5 avec Pytable), HTML, XML, JSON, MongoDB, SQL...
+ **Gestion d’une table** : sélection des lignes, colonnes, transformations, réorganisation par niveau d’un facteur, discrétisation de variables quantitatives, exclusion ou imputation élémentaire de données manquantes, permutation et échantillonnage aléatoire, variables indicatrices, chaînes de caractères...
+ **Statistiques** élémentaires uni et bivariées, tri à plat (nombre de modalités, devaleurs nulles, de valeurs manquantes...), graphiques associés, statistiques par groupe, détection élémentaire de valeurs atypiques...
+ **Manipulation de tables** : concaténations, fusions, jointures, tri, gestion des types et formats

## Installation

In [1]:
!pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (0.24.2)
Requirement already satisfied: numpy>=1.12.0 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (1.15.4)
Requirement already satisfied: python-dateutil>=2.5.0 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (2.7.5)
Requirement already satisfied: pytz>=2011k in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (2019.1)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)


## Series

Une [Series](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.html) est un objet uni-dimensionnel similaire à un tableau, une liste ou une colonne d'une table. Chaque valeur est associée à un index qui est par défaut les entiers de $0$ à  $N−1$  (avec  N  la longueur de la Series).

In [2]:
import pandas
from pandas import Series
import numpy
s = Series([42, 'Bonjour!', 3.14, -5, None, numpy.nan])
s.head()

0          42
1    Bonjour!
2        3.14
3          -5
4        None
dtype: object

On peut aussi préciser les indices lors de la création.

In [3]:
s2 = Series([42, 'Bonjour!', 3.14, -5, None, numpy.nan], 
            index=['int', 'string', 'pi', 'neg', 'missing1', 'missing2'])
s2

int               42
string      Bonjour!
pi              3.14
neg               -5
missing1        None
missing2         NaN
dtype: object

On peut aussi construire la Series à partir d'un dictionnaire si on fournit un index avec un dictionnaire, les index qui ne sont pas des clés du dictionnaire seront des valeurs manquantes.

In [4]:
city2cp_dict = {'Paris14': 75014, 'Paris18': 75018, 'Malakoff': 92240, 'Nice': 6300}
cities = Series(city2cp_dict)
cities

Paris14     75014
Paris18     75018
Malakoff    92240
Nice         6300
dtype: int64

## DataFrame

Un DataFrame est un objet qui est présent dans la plupart des logiciels de traitements de données. C'est une matrice, chaque colonne est une **Series** et est de même type (nombre, date, texte), elle peut contenir des valeurs manquantes (nan). On peut considérer chaque colonne comme les variables d'une table.

Un Dataframe représente une table de données, i.e. une collection ordonnées de colonnes. Ces colonnes/lignes peuvent avoir des types différents (numérique, string, boolean). Cela est très similaire aux DataFrame du langage R (en apparence...), avec un traitement plus symétrique des lignes et des colonnes. C’est un tableau bi-dimensionnel
avec des index de lignes et de colonnes mais il peut également être vu comme une liste de **Series** partageant le même index. L’index de colonne (noms des variables) est un objet de type dict (dictionnaire).

In [5]:
import pandas
l = [ { "date":"2014-06-22", "prix":220.0, "devise":"euros" }, 
      { "date":"2014-06-23", "prix":221.0, "devise":"euros" },]
df = pandas.DataFrame(l)
df

         date devise   prix
0  2014-06-22  euros  220.0
1  2014-06-23  euros  221.0

In [27]:
import pandas as pd
data = {"state": ["Ohio", "Ohio", "Ohio",
"Nevada", "Nevada"],
"year": [2000, 2001, 2002, 2001, 2002],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [31]:

matrix = frame.pivot_table(index='state', columns='year', values='pop')
matrix

year    2000  2001  2002
state
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [33]:
ratings = pd.DataFrame(matrix.groupby('state')['year'])
ratings.head()

KeyError: 'Column not found: year'

In [25]:
# ordre des colonnes
pd.DataFrame(data, columns=["year", "state", "pop"])
frame2 = pd.DataFrame(data)
frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [18]:
# index des lignes et valeurs manquantes (NaN)
frame2=pd.DataFrame(data, columns=["year", "state","pop", "debt"],
index=["one", "two", "three", "four", "five"])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [19]:
# liste des colonnes
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [5]:
# valeurs d’une colonne
frame["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [6]:
# valeurs d’une colonne
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [7]:
# "imputation"
frame2["debt"] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [8]:
# créer une variable
frame2["eastern"] = frame2.state == "Ohio"
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5  16.5     True
two    2001    Ohio  1.7  16.5     True
three  2002    Ohio  3.6  16.5     True
four   2001  Nevada  2.4  16.5    False
five   2002  Nevada  2.9  16.5    False

### Lecture et écriture de DataFrame

Cette section présente brièvement les fonctions qui permettent de lire/écrire un DataFrame aux formats texte/Excel. L'instruction encoding=utf-8 n'est pas obligatoire mais conseillée lorsque les données contiennent des accents.

#### Ecriture

In [10]:
import pandas
l = [ { "date":"2014-06-22", "prix":220.0, "devise":"euros" }, 
      { "date":"2014-06-23", "prix":221.0, "devise":"euros" },]
df = pandas.DataFrame(l)

# écriture au format texte
df.to_csv("exemple.txt",sep="\t",encoding="utf-8", index=False)

# on regarde ce qui a été enregistré
with open("exemple.txt", "r", encoding="utf-8") as f: 
    text = f.read()
print(text)

# on enregistre au format Excel
df.to_excel("exemple.xlsx", index=False)

date	devise	prix
2014-06-22	euros	220.0
2014-06-23	euros	221.0

#### Lecture

On peut récupérer des données directement depuis Internet ou une chaîne de caractères et afficher le début (*head*) ou la fin (*tail*).

Nous allons travailler avec les données : [heart.txt](./Data/marathon.txt) (source : R. Rakotomalala)

In [11]:

#chargement du fichier
#df est le nom de l'objet de type data frame créé
#sep spécifie le caractère séparateur de colonnes
#header = 0 : la ligne numéro 0 = aux noms des champs
#éventuellement decimal permet d'indiquer le point décimal
df = pandas.read_table("./Data/heart.txt",sep = '\t',header = 0)
#vérifions le type de df
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [12]:
#afficher les premières lignes du jeu de données
df.head()

   age      sexe typedouleur sucre  tauxmax angine  depression     coeur
0   70  masculin           D     A      109    non          24  presence
1   67   feminin           C     A      160    non          16   absence
2   57  masculin           B     A      141    non           3  presence
3   64  masculin           D     A      105    oui           2   absence
4   74   feminin           B     A      121    oui           2   absence

In [13]:
#dimensions : nombre de lignes, nombre de colonnes
#la ligne d'en-tête n'est pas comptabilisée
#dans le nombre de lignes
print(df.shape)

(270, 8)

In [14]:
#énumération des colonnes
print(df.columns)

Index(['age', 'sexe', 'typedouleur', 'sucre', 'tauxmax', 'angine',
       'depression', 'coeur'],
      dtype='object')

In [15]:
#type de chaque colonne
print(df.dtypes)

age             int64
sexe           object
typedouleur    object
sucre          object
tauxmax         int64
angine         object
depression      int64
coeur          object
dtype: object

In [16]:
#description des données
print(df.describe(include='all'))

               age      sexe typedouleur sucre     tauxmax angine  depression  \
count   270.000000       270         270   270  270.000000    270  270.000000
unique         NaN         2           4     2         NaN      2         NaN
top            NaN  masculin           D     A         NaN    non         NaN
freq           NaN       183         129   230         NaN    181         NaN
mean     54.433333       NaN         NaN   NaN  149.677778    NaN   10.500000
std       9.109067       NaN         NaN   NaN   23.165717    NaN   11.452098
min      29.000000       NaN         NaN   NaN   71.000000    NaN    0.000000
25%      48.000000       NaN         NaN   NaN  133.000000    NaN    0.000000
50%      55.000000       NaN         NaN   NaN  153.500000    NaN    8.000000
75%      61.000000       NaN         NaN   NaN  166.000000    NaN   16.000000
max      77.000000       NaN         NaN   NaN  202.000000    NaN   62.000000

          coeur
count       270
unique        2
top     absence
freq        150
mean        NaN
std         NaN
min         NaN
25%         NaN
50%         NaN
75%         NaN
max         NaN

#### Manipulation des variables

In [ ]:
#accès à une colonne
print(df['sucre'])

In [ ]:
#autre manière d'accéder à une colonne avec le .
print(df.sucre)

In [ ]:
#accéder à un ensemble de colonnes
print(df[['sexe','sucre']])

In [ ]:
#une colonne est un vecteur (Series en terminologie Pandas)
#affichage des premières valeurs
print(df['age'].head())

In [ ]:
#affichage des dernières valeurs
print(df['age'].tail())

#### Quelques statistiques

Voir les détails ici : http://pandas.pydata.org/pandas-docs/stable/basics.html#summarizing-data-describe

In [ ]:
print(df['age'].describe())

In [ ]:
#calculer explicitement la moyenne
print(df['age'].mean())

In [ ]:
#comptage des valeurs
print(df['typedouleur'].value_counts())

In [ ]:
#trier les valeurs d'une variable de manière croissante
print(df['age'].sort_values())

In [ ]:
#nous pouvons aussi obtenir les indices des valeurs triées
print(df['age'].argsort())

In [ ]:
# Appliquer une fonction
import numpy
#fonction call back
def operation(x):
    return(x.mean())
#appel de la fonction sur l'ensemble des colonnes du DataFrame
#axis = 0 ==> chaque colonne sera transmise à la fonction operation()
#la selection select_dtypes() permet d'exclure les variables non numériques

resultat = df.select_dtypes(exclude=['object']).apply(operation,axis=0)
print(resultat)

#### Accès indicé aux données d'un DataFrame
On peut accéder aux valeurs du DataFrame via des indices ou plages d'indice. La structure se comporte alors comme une
matrice. La cellule en haut et à gauche est de coordonnées (0,0).
Il y a différentes manières de le faire, l'utilisation de $.iloc[,]$ constitue une des solutions les plus simples.

In [ ]:
#accès à la valeur située en (0,0)
print(df.iloc[0,0])

In [ ]:
#5 premières valeurs de toutes les colonnes
#lignes => 0:5 (0 à 5 [non inclus])
#colonnes = : (toutes les colonnes)
print(df.iloc[0:5,:])

In [ ]:
#liste des individus présentant une douleur de type A
print(df.loc[df['typedouleur']=="A",:])

In [ ]:
#liste des individus présentant une douleur de type A et angine == oui
print(df.loc[(df['typedouleur']=="A") & (df['angine'] == "oui"),:])

In [ ]:
# Croisement de variables
print(pandas.crosstab(df['sexe'],df['coeur']))

In [ ]:
#scission des données selon le sexe
g = df.groupby('sexe')
#calculer la dimension du sous-DataFrame associé aux hommes
print(g.get_group('masculin').shape)

#### Exercice  : créer un fichier Excel (d'après X. Dupré)

On souhaite récupérer les `données donnees_enquete_2003_television.txt` (source : INSEE).

+ POIDSLOG : Pondération individuelle relative
+ POIDSF : Variable de pondération individuelle
+ cLT1FREQ : Nombre d'heures en moyenne passées à regarder la télévision
+ cLT2FREQ : Unité de temps utilisée pour compter le nombre d'heures passées à regarder la télévision, cette unité est représentée par les quatre valeurs suivantes
  + 0 : non concerné
  + 1 : jour
  + 2 : semaine
  + 3 : mois

Ensuite, on veut :

+ Supprimer les colonnes vides
+ Obtenir les valeurs distinctes pour la colonne cLT2FREQ
+ Modifier la matrice pour enlever les lignes pour lesquelles l'unité de temps (cLT2FREQ) n'est pas renseignée ou égale à zéro.
+ Sauver le résultat au format Excel.


Fonctions pouvant être utiles : **numpy.isnan, DataFrame.apply, DataFrame.fillna ou DataFrame.isnull, DataFrame.notnull, DataFrame.copy**

In [ ]:
# TO DO

#### Exercice : Manipulation de données réelles

Nous allons utiiser les données ouvertes fournies par l'assemblée nationale et plus spécifiquement les données sur les députés au format JSON. Elles sont disponibles ici : http://data.assemblee-nationale.fr/acteurs/deputes-en-exercice

Il s'agira donc dans un premier temps de :
 + Importer le fichier JSON avec Pandas
 + Comprendre la structure des données
 
Puis un ensemble d'analyses simples sera réalisé pour répondre aux questions suivantes :
 + Déterminer si la parité est respectée
 + Représenter le nombre de députés par tranche d’âge
 + Calculer l’âge moyen par sexe
 + Lister les catégories professionnelles et métiers puis à représenter ceci de manière lisible par sexe.

In [ ]:
import json

data_file_name = "./Data/deputes.json"
with open(data_file_name) as data_file:
    json_data = json.load(data_file, encoding='utf-8')
print(json_data.keys())
json_data['export'].keys()